# Demo 2.4 Part 2: Top N    

- **Demonstrates**:  
  - iloc[] to get Top N rowsof a Dataframe

In [1]:
import pandas as pd

### Read data into Dataframe

In [2]:
df = pd.read_csv('Data/Olympics.csv')

print(df.shape)
df.head(10)

(87, 6)

   Rank              Country  Gold  Silver  Bronze  Total
0     1  United States (USA)    46      37      38    121
1     2  Great Britain (GBR)    27      23      17     67
2     3          China (CHN)    26      18      26     70
3     4         Russia (RUS)    19      17      19     55
4     5        Germany (GER)    17      10      15     42
5     6          Japan (JPN)    12       8      21     41
6     7         France (FRA)    10      18      14     42
7     8    South Korea (KOR)     9       3       9     21
8     9          Italy (ITA)     8      12       8     28
9    10      Australia (AUS)     8      11      10     29

### Change Data Types as Needed  
- If we want to do numeric calculations on a column it is important that pandas recognizes it as numeric. 
- We also want to make sure a column is a float (rather than integer) if needed.
- Otherwise either errors or weird results are going to happen!

In [3]:
# Check data types
df.dtypes

Rank        int64
Country    object
Gold        int64
Silver      int64
Bronze      int64
Total       int64
dtype: object

# Question:  What are the Top 5 Countries for Gold Medals

# Sort Data

In [7]:
df.sort_values(by='Gold', ascending=False, inplace=True)

print(df.shape)
df.head(10)

(87, 6)

    Rank              Country  Gold  Silver  Bronze  Total
0      1  United States (USA)    46      37      38    121
1      2  Great Britain (GBR)    27      23      17     67
2      3          China (CHN)    26      18      26     70
3      4         Russia (RUS)    19      17      19     55
4      5        Germany (GER)    17      10      15     42
5      6          Japan (JPN)    12       8      21     41
6      7         France (FRA)    10      18      14     42
7      8    South Korea (KOR)     9       3       9     21
11    12        Hungary (HUN)     8       3       4     15
10    11    Netherlands (NED)     8       7       4     19

#  Create a new Top N dataset using *iloc[]*

In [5]:
df_TopN = df.iloc[ : 5]

print(df_TopN.shape)
df_TopN

(5, 6)

   Rank              Country  Gold  Silver  Bronze  Total
0     1  United States (USA)    46      37      38    121
1     2  Great Britain (GBR)    27      23      17     67
2     3          China (CHN)    26      18      26     70
3     4         Russia (RUS)    19      17      19     55
4     5        Germany (GER)    17      10      15     42